_emacs.d/init/init-ivy.org
#+TITLE:    The Family Box of Packages by abo-abo
#+AUTHOR:   Zuogong Yue
#+EMAIL:    oracleyue@gmail.com
#+DATE:     01 May 2018
#+STARTUP:  indent
#+OPTIONS:  H:6 num:t toc:t ^:nil _:nil \n:nil LaTeX:t


* Ivy - a generic completion frontend (swiper, counsel, etc.)

** Requirements
*** Install system commandline tools

Tools to be installed in order to use the corresponding commands in Ivzyue/
(package names in Homebrew)

- ~counsel-ag~  : ~ag~ from =the_silver_searcher=
- ~counsel-ack~ : ~ack~ from =ack=
- ~counsel-rg~  : ~rg~ from =ripgrep=
- ~counsel-git~ : ~git~
- ~counsel-fzf~ : ~fzf~ (a command-line fuzzy finder)

*** Install packages for Emacs

  #+BEGIN_SRC emacs-lisp
    ;; ===============================================================
    ;; Ivy - a generic completion mechanism for Emacs
    ;; ===============================================================
    ;; Last modified on 31 Mar 2018


    ;; Install required Emacs packages
    (setq custom/ivy-ext-packages
          '(ivy
            counsel
            swiper
            wgrep
            counsel-projectile
            counsel-gtags))
    (custom/install-packages custom/ivy-ext-packages)
  #+END_SRC

** Ivy, Counsel and Swiper

List of frequent commands:

- grep buffers:
  - ~swiper~ or ~counsel-grep-or-swiper~ (large files) (=C-s=)
  - ~swiper-all~ (=M-g s=) grep all buffers
  - ~swiper-multi~ grep the selected buffers
- grep directory (recursively):
  - ~counsel-ag~ (=M-g a=)
  - ~counsel-ack~
  - ~counsel-rg~ (=M-g r=) (for large files)
- grep git projects:
  - ~counsel-git~ (=C-c g=) (select a file tracked by git)
  - ~counsel-git-grep~ or use ~counsel-rg~ instead
- find files in directory recursively ~counsel-fzf~ (=M-g f=)

*** Basics
#+BEGIN_SRC emacs-lisp
  ;; ---------------------------------------------
  ;; /Ivy + Counsel + Swiper/: by abo-abo
  ;; ---------------------------------------------

  ;; Configurations
  (ivy-mode 1)
  (setq ivy-height 15)
  (setq ivy-use-virtual-buffers t)
  (setq enable-recursive-minibuffers t)
  (setq ivy-use-selectable-prompt t)  ;; make inputs selectable
#+END_SRC

*** Keybindings

Ivy-based interface to standard commands:
#+BEGIN_SRC emacs-lisp
  (global-set-key (kbd "C-s") 'swiper)  ;; or use counsel-grep-or-swiper
  (global-set-key (kbd "M-x") 'counsel-M-x)
  (global-set-key (kbd "C-x C-f") 'counsel-find-file)
  (global-set-key (kbd "<f1> l") 'counsel-find-library)
  (global-set-key (kbd "<f2> k") 'counsel-descbinds)
  (global-set-key (kbd "<f2> i") 'counsel-info-lookup-symbol)
  (global-set-key (kbd "<f2> u") 'counsel-unicode-char)
  (global-set-key (kbd "C-c C-r") 'ivy-resume)
#+END_SRC


Ivy-based interface to basic editing and programming
#+BEGIN_SRC emacs-lisp
  (global-set-key (kbd "M-y") 'counsel-yank-pop)
  (global-set-key (kbd "M-g SPC") 'counsel-mark-ring)  ;; M-SPC
  (global-set-key (kbd "M-g i") 'counsel-semantic-or-imenu) ;; C-c i
#+END_SRC

Ivy-based interface to shell and system tools:
#+BEGIN_SRC emacs-lisp
  (global-set-key (kbd "C-c g") 'counsel-git)
  ;; (global-set-key (kbd "C-c j") 'counsel-git-grep)  ;; replaced by counsel-rg
  (global-set-key (kbd "M-g C-s") 'swiper-all)
  ;; alternative ~swiper~ for large files
  ;; (global-set-key (kbd "M-g s") 'counsel-grep-or-swiper)
  (global-set-key (kbd "M-g s") 'counsel-grep)
  (setq counsel-grep-base-command
   "rg -i -M 120 --no-heading --line-number --color never '%s' %s")
  (global-set-key (kbd "M-g a") 'counsel-ag)    ;; C-c k
  ;; (global-set-key (kbd "M-g k") 'counsel-ack)
  (global-set-key (kbd "M-g r") 'counsel-rg)    ;; large files
  (global-set-key (kbd "M-g f") 'counsel-fzf)   ;; helm-find
  ;; (global-set-key (kbd "M-g l") 'counsel-locate)  ;; C-x l
#+END_SRC

