_emacs.d/init/init-ivy.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2018-05-02 Wed 18:46 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>The Family Box of Packages by abo-abo</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Zuogong Yue" />
<link rel="stylesheet" type="text/css" media="all" href="/Users/oracleyue/.emacs.d/templates/css/bootstrap.min.css" />
<link rel="stylesheet" type="text/css" media="all" href="/Users/oracleyue/.emacs.d/templates/css/style.css" />
</head>
<body>
<div id="content">
<h1 class="title">The Family Box of Packages by abo-abo</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org27e8c4a">1. Ivy - a generic completion frontend (swiper, counsel, etc.)</a>
<ul>
<li><a href="#orga23a664">1.1. Requirements</a>
<ul>
<li><a href="#org06cd55e">1.1.1. Install system commandline tools</a></li>
<li><a href="#orgb697f11">1.1.2. Install packages for Emacs</a></li>
</ul>
</li>
<li><a href="#org35eff3d">1.2. Ivy, Counsel and Swiper</a>
<ul>
<li><a href="#org28a6803">1.2.1. Basics</a></li>
<li><a href="#org6565151">1.2.2. Keybindings</a></li>
<li><a href="#org8427318">1.2.3. Minibuffer actions</a></li>
<li><a href="#orgc9fdf07">1.2.4. Ivy-occur and available actions</a></li>
<li><a href="#orgb9c9c81">1.2.5. Advanced features of ripgrep and counsel-rg</a></li>
<li><a href="#org6c1f960">1.2.6. Refactoring workflow via ivy-occur</a></li>
</ul>
</li>
<li><a href="#org39b0079">1.3. Ivy for projectile</a></li>
<li><a href="#org2e5f898">1.4. Ivy for GNU global tags</a></li>
</ul>
</li>
<li><a href="#orge609588">2. Hydra - make Emacs bindings that stick around</a>
<ul>
<li><a href="#orge7557ba">2.1. Supports for Counsel</a></li>
</ul>
</li>
<li><a href="#orgaba00cf">3. Avy - jump to things in Emacs tree-style</a></li>
<li><a href="#org9cd96e8">4. END</a></li>
</ul>
</div>
</div>


<div id="outline-container-org27e8c4a" class="outline-2">
<h2 id="org27e8c4a"><span class="section-number-2">1</span> Ivy - a generic completion frontend (swiper, counsel, etc.)</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-orga23a664" class="outline-3">
<h3 id="orga23a664"><span class="section-number-3">1.1</span> Requirements</h3>
<div class="outline-text-3" id="text-1-1">
</div>
<div id="outline-container-org06cd55e" class="outline-4">
<h4 id="org06cd55e"><span class="section-number-4">1.1.1</span> Install system commandline tools</h4>
<div class="outline-text-4" id="text-1-1-1">
<p>
Tools to be installed in order to use the corresponding commands in Ivy:
(package names in Homebrew)
</p>

<ul class="org-ul">
<li><code>counsel-ag</code>  : <code>ag</code> from <code>the_silver_searcher</code></li>
<li><code>counsel-ack</code> : <code>ack</code> from <code>ack</code></li>
<li><code>counsel-rg</code>  : <code>rg</code> from <code>ripgrep</code></li>
<li><code>counsel-git</code> : <code>git</code></li>
<li><code>counsel-fzf</code> : <code>fzf</code> (a command-line fuzzy finder)</li>
</ul>
</div>
</div>

<div id="outline-container-orgb697f11" class="outline-4">
<h4 id="orgb697f11"><span class="section-number-4">1.1.2</span> Install packages for Emacs</h4>
<div class="outline-text-4" id="text-1-1-2">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #5C6370;">;; </span><span style="color: #5C6370;">===============================================================</span>
<span style="color: #5C6370;">;; </span><span style="color: #5C6370;">Ivy - a generic completion mechanism for Emacs</span>
<span style="color: #5C6370;">;; </span><span style="color: #5C6370;">===============================================================</span>
<span style="color: #5C6370;">;; </span><span style="color: #5C6370;">Last modified on 31 Mar 2018</span>


<span style="color: #5C6370;">;; </span><span style="color: #5C6370;">Install required Emacs packages</span>
(<span style="color: #C678DD;">setq</span> custom/ivy-ext-packages
      '(ivy
        counsel
        swiper
        wgrep
        ivy-hydra
        counsel-projectile
        counsel-gtags))
(custom/install-packages custom/ivy-ext-packages)
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org35eff3d" class="outline-3">
<h3 id="org35eff3d"><span class="section-number-3">1.2</span> Ivy, Counsel and Swiper</h3>
<div class="outline-text-3" id="text-1-2">
<p>
List of frequent commands:
</p>

<ul class="org-ul">
<li>grep buffers:
<ul class="org-ul">
<li><code>swiper</code> or <code>counsel-grep-or-swiper</code> (large files) (<code>C-s</code>)</li>
<li><code>swiper-all</code> (<code>M-g s</code>) grep all buffers</li>
<li><code>swiper-multi</code> grep the selected buffers</li>
</ul></li>
<li>grep directory (recursively):
<ul class="org-ul">
<li><code>counsel-ag</code> (<code>M-g a</code>)</li>
<li><code>counsel-ack</code></li>
<li><code>counsel-rg</code> (<code>M-g r</code>) (for large files)</li>
</ul></li>
<li>grep git projects:
<ul class="org-ul">
<li><code>counsel-git</code> (<code>C-c g</code>) (select a file tracked by git)</li>
<li><code>counsel-git-grep</code> or use <code>counsel-rg</code> instead</li>
</ul></li>
<li>find files in directory recursively <code>counsel-fzf</code> (<code>M-g f</code>)</li>
</ul>
</div>

<div id="outline-container-org28a6803" class="outline-4">
<h4 id="org28a6803"><span class="section-number-4">1.2.1</span> Basics</h4>
<div class="outline-text-4" id="text-1-2-1">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #5C6370;">;; </span><span style="color: #5C6370;">---------------------------------------------</span>
<span style="color: #5C6370;">;; </span><span style="color: #5C6370;">/Ivy + Counsel + Swiper/: by abo-abo</span>
<span style="color: #5C6370;">;; </span><span style="color: #5C6370;">---------------------------------------------</span>

<span style="color: #5C6370;">;; </span><span style="color: #5C6370;">Configurations</span>
(ivy-mode 1)
(<span style="color: #C678DD;">setq</span> ivy-height 15)
(<span style="color: #C678DD;">setq</span> ivy-use-virtual-buffers t)
(<span style="color: #C678DD;">setq</span> enable-recursive-minibuffers t)
(<span style="color: #C678DD;">setq</span> ivy-use-selectable-prompt t)  <span style="color: #5C6370;">;; </span><span style="color: #5C6370;">make inputs selectable</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org6565151" class="outline-4">
<h4 id="org6565151"><span class="section-number-4">1.2.2</span> Keybindings</h4>
<div class="outline-text-4" id="text-1-2-2">
<p>
Ivy-based interface to standard commands:
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #5C6370;">;; </span><span style="color: #5C6370;">(global-set-key (kbd "C-s") 'swiper)  ;; use counsel-grep-or-swiper</span>
(global-set-key (kbd <span style="color: #98C379;">"M-x"</span>) 'counsel-M-x)
(global-set-key (kbd <span style="color: #98C379;">"C-x C-f"</span>) 'counsel-find-file)
(global-set-key (kbd <span style="color: #98C379;">"&lt;f1&gt; l"</span>) 'counsel-find-library)
(global-set-key (kbd <span style="color: #98C379;">"&lt;f2&gt; k"</span>) 'counsel-descbinds)
(global-set-key (kbd <span style="color: #98C379;">"&lt;f2&gt; i"</span>) 'counsel-info-lookup-symbol)
(global-set-key (kbd <span style="color: #98C379;">"&lt;f2&gt; u"</span>) 'counsel-unicode-char)
(global-set-key (kbd <span style="color: #98C379;">"C-c C-r"</span>) 'ivy-resume)
</pre>
</div>


<p>
Ivy-based interface to basic editing and programming
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp">(global-set-key (kbd <span style="color: #98C379;">"M-y"</span>) 'counsel-yank-pop)
(global-set-key (kbd <span style="color: #98C379;">"M-g SPC"</span>) 'counsel-mark-ring)  <span style="color: #5C6370;">;; </span><span style="color: #5C6370;">M-SPC</span>
(global-set-key (kbd <span style="color: #98C379;">"M-g i"</span>) 'counsel-semantic-or-imenu) <span style="color: #5C6370;">;; </span><span style="color: #5C6370;">C-c i</span>
</pre>
</div>

<p>
Ivy-based interface to shell and system tools:
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp">(global-set-key (kbd <span style="color: #98C379;">"C-c g"</span>) 'counsel-git)
<span style="color: #5C6370;">;; </span><span style="color: #5C6370;">(global-set-key (kbd "C-c j") 'counsel-git-grep)  ;; replaced by counsel-rg</span>
(global-set-key (kbd <span style="color: #98C379;">"M-g s"</span>) 'swiper-all)
<span style="color: #5C6370;">;; </span><span style="color: #5C6370;">alternative ~swiper~ for large files</span>
(global-set-key (kbd <span style="color: #98C379;">"C-s"</span>) 'counsel-grep-or-swiper)
(<span style="color: #C678DD;">setq</span> counsel-grep-base-command
 <span style="color: #98C379;">"rg -i -M 120 --no-heading --line-number --color never '%s' %s"</span>)
(global-set-key (kbd <span style="color: #98C379;">"M-g a"</span>) 'counsel-ag)    <span style="color: #5C6370;">;; </span><span style="color: #5C6370;">C-c k</span>
<span style="color: #5C6370;">;; </span><span style="color: #5C6370;">(global-set-key (kbd "M-g k") 'counsel-ack)</span>
(global-set-key (kbd <span style="color: #98C379;">"M-g r"</span>) 'counsel-rg)    <span style="color: #5C6370;">;; </span><span style="color: #5C6370;">large files</span>
(global-set-key (kbd <span style="color: #98C379;">"M-g f"</span>) 'counsel-fzf)   <span style="color: #5C6370;">;; </span><span style="color: #5C6370;">helm-find</span>
<span style="color: #5C6370;">;; </span><span style="color: #5C6370;">(global-set-key (kbd "M-g l") 'counsel-locate)  ;; C-x l</span>
</pre>
</div>
</div>
</div>
