_emacs.d/init/init-ivy.org
*** Minibuffer actions

One may go to the INFO page (=C-h i=) of Ivy to see the complete manual.
The recommended setting of additional minibuffer actions:
#+BEGIN_SRC emacs-lisp
  (define-key minibuffer-local-map (kbd "C-r")
    'counsel-minibuffer-history)
  ;; ensure recentf-list loaded on startup
  (with-eval-after-load 'counsel (recentf-mode))
  ;; disable recentf-list loading via ivy-switch-buffer
  ;; (setq recentf-initialize-file-name-history nil)
#+END_SRC
(For these two additional settings, see https://github.com/abo-abo/swiper/issues/1515.)

Customization to restore a few =helm= actions:
#+BEGIN_SRC (!not working)
  (define-key minibuffer-local-map (kbd "C-o")
    'ivy-beginning-of-buffer)
#+END_SRC

A brief summary of minibuffer actions in ~counsel-find-files~:
-  =C-j=: start a new completion; otherwise, same as =RET=;
-  =TAB=: attempts partial completion; =TAB TAB= same as =C-j=;
-  =C-M-j=: exits with the current input instead of candidates;
-  =M-i=: insert the current candidate into the minibuffer;
-  =M-o=: presents valid actions;
-  =M-n=, =M-p=: cycles through the Ivy command history;
-  =S-SPC=: deletes the current input and rests the list.

A summary of file name completions:
- =C-j= (~ivy-alt-done~):
    On a directory, restarts completion from that directory.
    On a file or ./, exit completion with the selected candidate.
- =DEL= (~ivy-backward-delete-char~): Restart the completion in the parent
  directory if current input is empty.
- =//= (~self-insert-command~):
    Switch to the root directory.
- =~= (~self-insert-command~):
    Switch to the home directory.
- =/= (~self-insert-command~): If the current input matches an existing
  directory name exactly, switch the completion to that directory.
- =M-r= (~ivy-toggle-regexp-quote~):
    Toggle between input as regexp or not.
    Switch to matching literally since file names include ., which is for matching any char in regexp mode.

*** Feature configurations
Exclude boring files like =.DS_Store= in ~counsel-find-file~:
#+BEGIN_SRC emacs-lisp
  (setq counsel-find-file-ignore-regexp "\\.DS_Store\\'")
#+END_SRC

*** Ivy-occur and available actions

The bug is due to the incompatibility of commandline tools on OSX and Linux, for
example =xargs -d '\n'=, =-d= is not available on OSX.

#+BEGIN_SRC emacs-lisp
  (when *is-mac*
    (setq counsel-find-file-occur-cmd
          "gls -a | grep -i -E '%s' | tr '\\n' '\\0' | xargs -0 gls -d --group-directories-first"))
#+END_SRC


A summary of commands in the read-only =ivy-occur= buffer:
(WARNING: has been changed and no longer working!)
-  =RET= or =f= (~ivy-occur-press~):
    call the current action on the selected candidate.
-  =mouse-1= (~ivy-occur-click~);
    call the current action on the selected candidate.
-  =j= (~next-line~): move to next line.
-  =k= (~previous-line~): move to previous line.
-  =a= (~ivy-occur-read-action~):
    read an action and make it current for this buffer.
-  =o= (~ivy-occur-dispatch~):
    read an action and call it on the selected candidate.
-  =q= (~quit-window~): bury the current buffer.

*** Advanced features of ripgrep and counsel-rg

(source: https://oremacs.com/2018/03/05/grep-exclude/)

The main two commands in ivy that I use for Git are:
-  ~counsel-git~: select a file tracked by Git
-  ~counsel-rg~: grep for a line in all files tracked by Git, using =ripgrep= as
  the backend.

Among the available grep tools, ~counsel-rg~ is the fastest, especially when we
have to deal with Git repositories that more than 1GB in size. Moreover, adding
an =.ignore= file to the root of your project can really speed up your
searches. In my sample project, I went from 10k files to less than 500 files.

Example of =.ignore= files:
#+BEGIN_EXAMPLE
  /TAGS
  ,*.min.js*
  /Build/Output/
  /ThirdParty/
#+END_EXAMPLE

As you can see, both file patterns and directories are supported. One other
nifty thing that I discovered only recently is that you can use =ripgrep= as the
backed for ~counsel-git~ in addition to ~counsel-rg~. Which means the same
=.ignore= file is used for both commands. Here's the setting:

#+BEGIN_SRC emacs-lisp
  (setq counsel-git-cmd "rg --files")
#+END_SRC

And here's the setting for ~counsel-rg~:

#+BEGIN_SRC emacs-lisp
  (setq counsel-rg-base-command
        "rg -i -M 120 --no-heading --line-number --color never %s .")
#+END_SRC

The main difference in comparison to the default =counsel-rg-base-command= is
=-M 120= which means: truncate all lines that are longer than 120
characters. This is really helpful when Emacs is accepting input from =ripgrep=: a
megabyte long line of minified JS is not only useless since you can't see it
whole, but it will also likely hang Emacs for a while.

*** Refactoring workflow via ivy-occur

The basic idea was that he wanted to change all occurrences of an identifier in
all files in a given directory. We do that by finding each occurrence with
=rgrep=, making the =rgrep= result buffer writable with =wgrep=, then using
=iedit= to change all occurrences at once.

The workflow is summarized as follows:
- run ~counsel-ag~  (or ~counsel-rg~  etc.) and call ~ivy-occur~ (=C-c C-o=)
- in the occur buffer, toggle =wgrep= by =C-x C-q= (~ivy-wgrep-change-to-wgrep-mode~)
- use =iedit= (=C-;=) for example to change all occurences
- exit =iedit= (=C-;=) and =wgrep= (=C-x s= or =C-c C-c=) (~wgrep-finish-edit~)
- kill the occur buffer after confirmation

Sources:
- https://sam217pa.github.io/2016/09/11/nuclear-power-editing-via-ivy-and-ag/
- https://oremacs.com/2015/01/27/my-refactoring-workflow/
- http://irreal.org/blog/?p=6008

