_emacs.d/init/init-ivy.html

<div id="outline-container-org8427318" class="outline-4">
<h4 id="org8427318"><span class="section-number-4">1.2.3</span> Minibuffer actions</h4>
<div class="outline-text-4" id="text-1-2-3">
<p>
One may go to the INFO page (<code>C-h i</code>) of Ivy to see the complete manual.
The recommended setting of additional minibuffer actions:
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp">(define-key minibuffer-local-map (kbd <span style="color: #98C379;">"C-r"</span>)
  'counsel-minibuffer-history)
<span style="color: #5C6370;">;; </span><span style="color: #5C6370;">ensure recentf-list loaded on startup</span>
(<span style="color: #C678DD;">with-eval-after-load</span> 'counsel (recentf-mode))
<span style="color: #5C6370;">;; </span><span style="color: #5C6370;">disable recentf-list loading via ivy-switch-buffer</span>
<span style="color: #5C6370;">;; </span><span style="color: #5C6370;">(setq recentf-initialize-file-name-history nil)</span>
</pre>
</div>
<p>
(For these two additional settings, see <a href="https://github.com/abo-abo/swiper/issues/1515">https://github.com/abo-abo/swiper/issues/1515</a>.)
</p>


<p>
A brief summary of minibuffer actions in <code>counsel-find-files</code>:
</p>
<ul class="org-ul">
<li><code>C-j</code>: start a new completion; otherwise, same as <code>RET</code>;</li>
<li><code>TAB</code>: attempts partial completion; <code>TAB TAB</code> same as <code>C-j</code>;</li>
<li><code>C-M-j</code>: exits with the current input instead of candidates;</li>
<li><code>M-i</code>: insert the current candidate into the minibuffer;</li>
<li><code>M-o</code>: presents valid actions;</li>
<li><code>M-n</code>, <code>M-p</code>: cycles through the Ivy command history;</li>
<li><code>S-SPC</code>: deletes the current input and rests the list.</li>
</ul>

<p>
A summary of file name completions:
</p>
<ul class="org-ul">
<li><code>C-j</code> (<code>ivy-alt-done</code>):
On a directory, restarts completion from that directory.
On a file or ./, exit completion with the selected candidate.</li>
<li><code>DEL</code> (<code>ivy-backward-delete-char</code>): Restart the completion in the parent
directory if current input is empty.</li>
<li><code>//</code> (<code>self-insert-command</code>):
Switch to the root directory.</li>
<li><code>~</code> (<code>self-insert-command</code>):
Switch to the home directory.</li>
<li><code>/</code> (<code>self-insert-command</code>): If the current input matches an existing
directory name exactly, switch the completion to that directory.</li>
<li><code>M-r</code> (<code>ivy-toggle-regexp-quote</code>):
Toggle between input as regexp or not.
Switch to matching literally since file names include ., which is for matching any char in regexp mode.</li>
</ul>
</div>
</div>

<div id="outline-container-orgc9fdf07" class="outline-4">
<h4 id="orgc9fdf07"><span class="section-number-4">1.2.4</span> Ivy-occur and available actions</h4>
<div class="outline-text-4" id="text-1-2-4">
<p>
The bug is due to the incompatibility of commandline tools on OSX and Linux, for
example <code>xargs -d '\n'</code>, <code>-d</code> is not available on OSX.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #C678DD;">when</span> *is-mac*
  (<span style="color: #C678DD;">setq</span> counsel-find-file-occur-cmd
        <span style="color: #98C379;">"gls -a | grep -i -E '%s' | tr '\\n' '\\0' | xargs -0 gls -d --group-directories-first"</span>))
</pre>
</div>


<p>
A summary of commands in the read-only <code>ivy-occur</code> buffer:
(WARNING: has been changed and no longer working!)
</p>
<ul class="org-ul">
<li><code>RET</code> or <code>f</code> (<code>ivy-occur-press</code>):
call the current action on the selected candidate.</li>
<li><code>mouse-1</code> (<code>ivy-occur-click</code>);
call the current action on the selected candidate.</li>
<li><code>j</code> (<code>next-line</code>): move to next line.</li>
<li><code>k</code> (<code>previous-line</code>): move to previous line.</li>
<li><code>a</code> (<code>ivy-occur-read-action</code>):
read an action and make it current for this buffer.</li>
<li><code>o</code> (<code>ivy-occur-dispatch</code>):
read an action and call it on the selected candidate.</li>
<li><code>q</code> (<code>quit-window</code>): bury the current buffer.</li>
</ul>
</div>
</div>

<div id="outline-container-orgb9c9c81" class="outline-4">
<h4 id="orgb9c9c81"><span class="section-number-4">1.2.5</span> Advanced features of ripgrep and counsel-rg</h4>
<div class="outline-text-4" id="text-1-2-5">
<p>
(source: <a href="https://oremacs.com/2018/03/05/grep-exclude/">https://oremacs.com/2018/03/05/grep-exclude/</a>)
</p>

<p>
The main two commands in ivy that I use for Git are:
</p>
<ul class="org-ul">
<li><code>counsel-git</code>: select a file tracked by Git</li>
<li><code>counsel-rg</code>: grep for a line in all files tracked by Git, using <code>ripgrep</code> as
the backend.</li>
</ul>

<p>
Among the available grep tools, <code>counsel-rg</code> is the fastest, especially when we
have to deal with Git repositories that more than 1GB in size. Moreover, adding
an <code>.ignore</code> file to the root of your project can really speed up your
searches. In my sample project, I went from 10k files to less than 500 files.
</p>

<p>
Example of <code>.ignore</code> files:
</p>
<pre class="example">
/TAGS
*.min.js*
/Build/Output/
/ThirdParty/
</pre>

<p>
As you can see, both file patterns and directories are supported. One other
nifty thing that I discovered only recently is that you can use <code>ripgrep</code> as the
backed for <code>counsel-git</code> in addition to <code>counsel-rg</code>. Which means the same
<code>.ignore</code> file is used for both commands. Here's the setting:
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #C678DD;">setq</span> counsel-git-cmd <span style="color: #98C379;">"rg --files"</span>)
</pre>
</div>

<p>
And here's the setting for <code>counsel-rg</code>:
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #C678DD;">setq</span> counsel-rg-base-command
      <span style="color: #98C379;">"rg -i -M 120 --no-heading --line-number --color never %s ."</span>)
</pre>
</div>

<p>
The main difference in comparison to the default <code>counsel-rg-base-command</code> is
<code>-M 120</code> which means: truncate all lines that are longer than 120
characters. This is really helpful when Emacs is accepting input from <code>ripgrep</code>: a
megabyte long line of minified JS is not only useless since you can't see it
whole, but it will also likely hang Emacs for a while.
</p>
</div>
</div>

<div id="outline-container-org6c1f960" class="outline-4">
<h4 id="org6c1f960"><span class="section-number-4">1.2.6</span> Refactoring workflow via ivy-occur</h4>
<div class="outline-text-4" id="text-1-2-6">
<p>
The basic idea was that he wanted to change all occurrences of an identifier in
all files in a given directory. We do that by finding each occurrence with
<code>rgrep</code>, making the <code>rgrep</code> result buffer writable with <code>wgrep</code>, then using
<code>iedit</code> to change all occurrences at once.
</p>

<p>
The workflow is summarized as follows:
</p>
<ul class="org-ul">
<li>run <code>counsel-ag</code>  (or <code>counsel-rg</code>  etc.) and call <code>ivy-occur</code> (<code>C-c C-o</code>)</li>
<li>in the occur buffer, toggle <code>wgrep</code> by <code>C-x C-q</code> (<code>ivy-wgrep-change-to-wgrep-mode</code>)</li>
<li>use <code>iedit</code> (<code>C-;</code>) for example to change all occurences</li>
<li>exit <code>iedit</code> (<code>C-;</code>) and <code>wgrep</code> (<code>C-x s</code> or <code>C-c C-c</code>) (<code>wgrep-finish-edit</code>)</li>
<li>kill the occur buffer after confirmation</li>
</ul>

<p>
Sources:
</p>
<ul class="org-ul">
<li><a href="https://sam217pa.github.io/2016/09/11/nuclear-power-editing-via-ivy-and-ag/">https://sam217pa.github.io/2016/09/11/nuclear-power-editing-via-ivy-and-ag/</a></li>
<li><a href="https://oremacs.com/2015/01/27/my-refactoring-workflow/">https://oremacs.com/2015/01/27/my-refactoring-workflow/</a></li>
<li><a href="http://irreal.org/blog/?p=6008">http://irreal.org/blog/?p=6008</a></li>
</ul>
</div>
</div>
</div>
