_emacs.d/init/init-ivy.el

(define-key minibuffer-local-map (kbd "C-r")
  'counsel-minibuffer-history)
;; ensure recentf-list loaded on startup
(with-eval-after-load 'counsel (recentf-mode))
;; disable recentf-list loading via ivy-switch-buffer
;; (setq recentf-initialize-file-name-history nil)

(setq counsel-find-file-ignore-regexp "\\.DS_Store\\'")

(when *is-mac*
  (setq counsel-find-file-occur-cmd
        "gls -a | grep -i -E '%s' | tr '\\n' '\\0' | xargs -0 gls -d --group-directories-first"))

(setq counsel-git-cmd "rg --files")

(setq counsel-rg-base-command
      "rg -i -M 120 --no-heading --line-number --color never %s .")

;; ---------------------------------------------
