_emacs.d/init/init-ivy.org
** Ivy for projectile

#+BEGIN_SRC emacs-lisp
  ;; ---------------------------------------------
  ;; /counsel-projectile/: Ivy for projectile
  ;; ---------------------------------------------
  (counsel-projectile-mode)
#+END_SRC

One may go to =~/.emacs.d/init/readme/= to see more the complete manual (the
README.md from the author's github project)

The most frequent used operations:
-  =C-c p p=: switch project
-  =C-c p f=: jump to a project file
-  =C-c p d=: jump to a project directory
-  =C-c p b=: jump to a project buffer
-  =C-c p s g=: search project with grep
-  =C-c p s s=: serach project with ag

-  =C-c p SPC=: jump to a project buffer, file, or switch project
-  =C-c p s r=: search project with rg
-  =C-c p O=:   Org-capture into project

** Ivy for GNU global tags

Enable =gtags= for the given major modes:
#+BEGIN_SRC emacs-lisp
  ;; ---------------------------------------------
  ;; /counsel-gtags/: Ivy for gtags (GNU global)
  ;; ---------------------------------------------
  (add-hook 'c-mode-hook 'counsel-gtags-mode)
  (add-hook 'c++-mode-hook 'counsel-gtags-mode)
  (add-hook 'python-mode-hook 'counsel-gtags-mode)
#+END_SRC

Keybindings:
#+BEGIN_SRC emacs-lisp
  (with-eval-after-load 'counsel-gtags
    ;; basic jumps
    (define-key counsel-gtags-mode-map (kbd "M-.") 'counsel-gtags-dwim)
    (define-key counsel-gtags-mode-map (kbd "M-,") 'counsel-gtags-go-backward)
    (define-key counsel-gtags-mode-map (kbd "M-t") 'counsel-gtags-find-definition)
    (define-key counsel-gtags-mode-map (kbd "M-r") 'counsel-gtags-find-reference)
    (define-key counsel-gtags-mode-map (kbd "M-s") 'counsel-gtags-find-symbol)
    ;; create/update tags
    (define-key counsel-gtags-mode-map (kbd "C-c g c") 'counsel-gtags-create-tags)
    (define-key counsel-gtags-mode-map (kbd "C-c g u") 'counsel-gtags-update-tags)
    ;; jump over stacks/history
    (define-key counsel-gtags-mode-map (kbd "C-c g [") 'counsel-gtags-go-backward)
    (define-key counsel-gtags-mode-map (kbd "C-c g ]") 'counsel-gtags-go-forward))
#+END_SRC



* Hydra - make Emacs bindings that stick around

This is a package for GNU Emacs that can be used to tie related commands into a
family of short bindings with a common prefix - a Hydra.

#+BEGIN_SRC
  ;; Install Hydra package
  (setq custom/hydra-packages
        '(hydra
          ivy-hydra))
  (custom/install-packages custom/hydra-packages)
#+END_SRC

** Supports for Counsel

It requires the package =ivy-hydra=, which defines the =hydra= rules for
=counsel=.

A summary of =hydra= commands available for =counsel=:
- use =C-o= (~hydra-ivy/body~) to invokes the hydra menu with short key
  bindings.
- when Hydra is active, minibuffer editing is disabled and menus display short
  aliases:

| Short | Normal    | Command name              |
|-------+-----------+---------------------------|
| =o=   | =C-g=     | ~keyboard-escape-quit~    |
| =j=   | =C-n=     | ~ivy-next-line~           |
| =k=   | =C-p=     | ~ivy-previous-line~       |
| =h=   | =M-<=     | ~ivy-beginning-of-buffer~ |
| =l=   | =M->=     | ~ivy-end-of-buffer~       |
| =d=   | =C-m=     | ~ivy-done~                |
| =f=   | =C-j=     | ~ivy-alt-done~            |
| =g=   | =C-M-m=   | ~ivy-call~                |
| =u=   | =C-c C-o= | ~ivy-occur~               |

Hydra menu offers more additional bindings:
-  =c= (~ivy-toggle-calling~)
  Toggle calling the action after each candidate change. It modifies j to jg, k to kg etc.
-  =m= (~ivy-rotate-preferred-builders~)
  Rotate the current regexp matcher.
-  =>= (~ivy-minibuffer-grow~)
  Increase ivy-height for the current minibuffer.
-  =<= (~ivy-minibuffer-shrink~)
  Decrease ivy-height for the current minibuffer.
-  =w= (~ivy-prev-action~)
  Select the previous action.
-  =s= (~ivy-next-action~)
  Select the next action.
-  =a= (~ivy-read-action~)
  Use a menu to select an action.
-  =C= (~ivy-toggle-case-fold~)
  Toggle case folding (match both upper and lower case characters for lower case input).


* Avy - jump to things in Emacs tree-style

Avy is a GNU Emacs package for jumping to visible text using a char-based
decision tree.


* END

#+BEGIN_SRC emacs-lisp
  (provide 'init-ivy)
  ;; ================================================
  ;; init-ivy.el ends here
#+END_SRC
