_emacs.d/init/init-ivy.html

<div id="outline-container-org39b0079" class="outline-3">
<h3 id="org39b0079"><span class="section-number-3">1.3</span> Ivy for projectile</h3>
<div class="outline-text-3" id="text-1-3">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #5C6370;">;; </span><span style="color: #5C6370;">---------------------------------------------</span>
<span style="color: #5C6370;">;; </span><span style="color: #5C6370;">/counsel-projectile/: Ivy for projectile</span>
<span style="color: #5C6370;">;; </span><span style="color: #5C6370;">---------------------------------------------</span>
(counsel-projectile-mode)
</pre>
</div>

<p>
One may go to <code>~/.emacs.d/init/readme/</code> to see more the complete manual (the
README.md from the author's github project)
</p>

<p>
The most frequent used operations:
</p>
<ul class="org-ul">
<li><code>C-c p p</code>: switch project</li>
<li><code>C-c p f</code>: jump to a project file</li>
<li><code>C-c p d</code>: jump to a project directory</li>
<li><code>C-c p b</code>: jump to a project buffer</li>
<li><code>C-c p s g</code>: search project with grep</li>
<li><code>C-c p s s</code>: serach project with ag</li>

<li><code>C-c p SPC</code>: jump to a project buffer, file, or switch project</li>
<li><code>C-c p s r</code>: search project with rg</li>
<li><code>C-c p O</code>:   Org-capture into project</li>
</ul>
</div>
</div>

<div id="outline-container-org2e5f898" class="outline-3">
<h3 id="org2e5f898"><span class="section-number-3">1.4</span> Ivy for GNU global tags</h3>
<div class="outline-text-3" id="text-1-4">
<p>
Enable <code>gtags</code> for the given major modes:
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #5C6370;">;; </span><span style="color: #5C6370;">---------------------------------------------</span>
<span style="color: #5C6370;">;; </span><span style="color: #5C6370;">/counsel-gtags/: Ivy for gtags (GNU global)</span>
<span style="color: #5C6370;">;; </span><span style="color: #5C6370;">---------------------------------------------</span>
(add-hook 'c-mode-hook 'counsel-gtags-mode)
(add-hook 'c++-mode-hook 'counsel-gtags-mode)
(add-hook 'python-mode-hook 'counsel-gtags-mode)
</pre>
</div>

<p>
Keybindings:
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #C678DD;">with-eval-after-load</span> 'counsel-gtags
  <span style="color: #5C6370;">;; </span><span style="color: #5C6370;">basic jumps</span>
  (define-key counsel-gtags-mode-map (kbd <span style="color: #98C379;">"M-."</span>) 'counsel-gtags-dwim)
  (define-key counsel-gtags-mode-map (kbd <span style="color: #98C379;">"M-,"</span>) 'counsel-gtags-go-backward)
  (define-key counsel-gtags-mode-map (kbd <span style="color: #98C379;">"M-t"</span>) 'counsel-gtags-find-definition)
  (define-key counsel-gtags-mode-map (kbd <span style="color: #98C379;">"M-r"</span>) 'counsel-gtags-find-reference)
  (define-key counsel-gtags-mode-map (kbd <span style="color: #98C379;">"M-s"</span>) 'counsel-gtags-find-symbol)
  <span style="color: #5C6370;">;; </span><span style="color: #5C6370;">create/update tags</span>
  (define-key counsel-gtags-mode-map (kbd <span style="color: #98C379;">"C-c g c"</span>) 'counsel-gtags-create-tags)
  (define-key counsel-gtags-mode-map (kbd <span style="color: #98C379;">"C-c g u"</span>) 'counsel-gtags-update-tags)
  <span style="color: #5C6370;">;; </span><span style="color: #5C6370;">jump over stacks/history</span>
  (define-key counsel-gtags-mode-map (kbd <span style="color: #98C379;">"C-c g ["</span>) 'counsel-gtags-go-backward)
  (define-key counsel-gtags-mode-map (kbd <span style="color: #98C379;">"C-c g ]"</span>) 'counsel-gtags-go-forward))
</pre>
</div>
</div>
</div>
</div>



<div id="outline-container-orge609588" class="outline-2">
<h2 id="orge609588"><span class="section-number-2">2</span> Hydra - make Emacs bindings that stick around</h2>
<div class="outline-text-2" id="text-2">
<p>
This is a package for GNU Emacs that can be used to tie related commands into a
family of short bindings with a common prefix - a Hydra.
</p>
</div>

<div id="outline-container-orge7557ba" class="outline-3">
<h3 id="orge7557ba"><span class="section-number-3">2.1</span> Supports for Counsel</h3>
<div class="outline-text-3" id="text-2-1">
<p>
It requires the package <code>ivy-hydra</code>, which defines the <code>hydra</code> rules for
<code>counsel</code>.
</p>

<p>
A summary of <code>hydra</code> commands available for <code>counsel</code>:
</p>
<ul class="org-ul">
<li>use <code>C-o</code> (<code>hydra-ivy/body</code>) to invokes the hydra menu with short key
bindings.</li>
<li>when Hydra is active, minibuffer editing is disabled and menus display short
aliases:</li>
</ul>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Short</th>
<th scope="col" class="org-left">Normal</th>
<th scope="col" class="org-left">Command name</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left"><code>o</code></td>
<td class="org-left"><code>C-g</code></td>
<td class="org-left"><code>keyboard-escape-quit</code></td>
</tr>

<tr>
<td class="org-left"><code>j</code></td>
<td class="org-left"><code>C-n</code></td>
<td class="org-left"><code>ivy-next-line</code></td>
</tr>

<tr>
<td class="org-left"><code>k</code></td>
<td class="org-left"><code>C-p</code></td>
<td class="org-left"><code>ivy-previous-line</code></td>
</tr>

<tr>
<td class="org-left"><code>h</code></td>
<td class="org-left"><code>M-&lt;</code></td>
<td class="org-left"><code>ivy-beginning-of-buffer</code></td>
</tr>

<tr>
<td class="org-left"><code>l</code></td>
<td class="org-left"><code>M-&gt;</code></td>
<td class="org-left"><code>ivy-end-of-buffer</code></td>
</tr>

<tr>
<td class="org-left"><code>d</code></td>
<td class="org-left"><code>C-m</code></td>
<td class="org-left"><code>ivy-done</code></td>
</tr>

<tr>
<td class="org-left"><code>f</code></td>
<td class="org-left"><code>C-j</code></td>
<td class="org-left"><code>ivy-alt-done</code></td>
</tr>

<tr>
<td class="org-left"><code>g</code></td>
<td class="org-left"><code>C-M-m</code></td>
<td class="org-left"><code>ivy-call</code></td>
</tr>

<tr>
<td class="org-left"><code>u</code></td>
<td class="org-left"><code>C-c C-o</code></td>
<td class="org-left"><code>ivy-occur</code></td>
</tr>
</tbody>
</table>

<p>
Hydra menu offers more additional bindings:
</p>
<ul class="org-ul">
<li><code>c</code> (<code>ivy-toggle-calling</code>)
Toggle calling the action after each candidate change. It modifies j to jg, k to kg etc.</li>
<li><code>m</code> (<code>ivy-rotate-preferred-builders</code>)
Rotate the current regexp matcher.</li>
<li><code>&gt;</code> (<code>ivy-minibuffer-grow</code>)
Increase ivy-height for the current minibuffer.</li>
<li><code>&lt;</code> (<code>ivy-minibuffer-shrink</code>)
Decrease ivy-height for the current minibuffer.</li>
<li><code>w</code> (<code>ivy-prev-action</code>)
Select the previous action.</li>
<li><code>s</code> (<code>ivy-next-action</code>)
Select the next action.</li>
<li><code>a</code> (<code>ivy-read-action</code>)
Use a menu to select an action.</li>
<li><code>C</code> (<code>ivy-toggle-case-fold</code>)
Toggle case folding (match both upper and lower case characters for lower case input).</li>
</ul>
</div>
</div>
</div>


<div id="outline-container-orgaba00cf" class="outline-2">
<h2 id="orgaba00cf"><span class="section-number-2">3</span> Avy - jump to things in Emacs tree-style</h2>
<div class="outline-text-2" id="text-3">
<p>
Avy is a GNU Emacs package for jumping to visible text using a char-based
decision tree.
</p>
</div>
</div>


<div id="outline-container-org9cd96e8" class="outline-2">
<h2 id="org9cd96e8"><span class="section-number-2">4</span> END</h2>
<div class="outline-text-2" id="text-4">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #C678DD;">provide</span> '<span style="color: #56B6C2;">init-ivy</span>)
<span style="color: #5C6370;">;; </span><span style="color: #5C6370;">================================================</span>
<span style="color: #5C6370;">;; </span><span style="color: #5C6370;">init-ivy.el ends here</span>
</pre>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Date: 01 May 2018</p>
<p class="author">Author: Zuogong Yue</p>
<p class="date">Created: 2018-05-02 Wed 18:46</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>