_emacs.d/init/init-ivy.el
;; /counsel-projectile/: Ivy for projectile
;; ---------------------------------------------
(counsel-projectile-mode)

;; ---------------------------------------------
;; /counsel-gtags/: Ivy for gtags (GNU global)
;; ---------------------------------------------
(add-hook 'c-mode-hook 'counsel-gtags-mode)
(add-hook 'c++-mode-hook 'counsel-gtags-mode)
(add-hook 'python-mode-hook 'counsel-gtags-mode)

(with-eval-after-load 'counsel-gtags
  ;; basic jumps
  (define-key counsel-gtags-mode-map (kbd "M-.") 'counsel-gtags-dwim)
  (define-key counsel-gtags-mode-map (kbd "M-,") 'counsel-gtags-go-backward)
  (define-key counsel-gtags-mode-map (kbd "M-t") 'counsel-gtags-find-definition)
  (define-key counsel-gtags-mode-map (kbd "M-r") 'counsel-gtags-find-reference)
  (define-key counsel-gtags-mode-map (kbd "M-s") 'counsel-gtags-find-symbol)
  ;; create/update tags
  (define-key counsel-gtags-mode-map (kbd "C-c g c") 'counsel-gtags-create-tags)
  (define-key counsel-gtags-mode-map (kbd "C-c g u") 'counsel-gtags-update-tags)
  ;; jump over stacks/history
  (define-key counsel-gtags-mode-map (kbd "C-c g [") 'counsel-gtags-go-backward)
  (define-key counsel-gtags-mode-map (kbd "C-c g ]") 'counsel-gtags-go-forward))

(provide 'init-ivy)
;; ================================================
;; init-ivy.el ends here
